src/Catalogs/УдалитьМашиночитаемыеДоверенностиКЭДО/УдалитьМашиночитаемыеДоверенностиКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УдалитьМашиночитаемыеДоверенностиКЭДО</name>
  <attributes>
    <name>Доверитель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйДоверителя</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйПредставителя</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Передоверие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доверенность</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможноПередоверие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВРеестре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакУтратыПолномочийПриПередоверии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МЧД</name>
    <type>
      <types>CatalogRef.МашиночитаемыеДоверенности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Полномочия</name>
    <attributes>
      <name>ТекстПолномочия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/УдалитьМашиночитаемыеДоверенностиКЭДО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ПометкаУдаления Тогда
		
		Если Не ЗначениеЗаполнено(ИмяФайлаДоверенности)
			И ДополнительныеСвойства.Свойство("СформироватьФайлПриЗаписи") Тогда
			
			Если НеобходимыеДанныеЗаполнены() Тогда
				Попытка
					Доверенность = Новый ХранилищеЗначения(
						Справочники.УдалитьМашиночитаемыеДоверенностиКЭДО.ТелоДоверенности(ЭтотОбъект), Новый СжатиеДанных(9));
				Исключение
					Ошибка = ИнформацияОбОшибке();
					ЗаписьЖурналаРегистрации(
						КадровыйЭДО.ИмяСобытияЖурналаРегистрации(НСтр("ru = 'Подготовка файла МЧД';
																		|en = 'Подготовка файла МЧД'")),
						УровеньЖурналаРегистрации.Ошибка,
						Метаданные.Справочники.УдалитьМашиночитаемыеДоверенностиКЭДО,
						Ссылка,
						ПодробноеПредставлениеОшибки(Ошибка));
				КонецПопытки;
			Иначе
				Доверенность = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НеобходимыеДанныеЗаполнены(ВыводитьСообщения = Ложь) Экспорт
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Доверитель) Тогда
		Если ВыводитьСообщения Тогда
			ТекстСообщения = НСтр("ru = 'Не задан доверитель';
									|en = 'Не задан доверитель'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "Доверитель", "Объект", Отказ);
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Доверитель) = Тип("СправочникСсылка.Организации") И Не ЗначениеЗаполнено(ОтветственныйДоверителя) Тогда
		Если ВыводитьСообщения Тогда
			ТекстСообщения = НСтр("ru = 'Не задан ответственный доверителя';
									|en = 'Не задан ответственный доверителя'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "ОтветственныйДоверителя", "Объект", Отказ);
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Представитель) Тогда
		Если ВыводитьСообщения Тогда
			ТекстСообщения = НСтр("ru = 'Не задан представитель';
									|en = 'Не задан представитель'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "Представитель", "Объект", Отказ);
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Представитель) = Тип("СправочникСсылка.Организации") И Не ЗначениеЗаполнено(ОтветственныйПредставителя) Тогда
		Если ВыводитьСообщения Тогда
			ТекстСообщения = НСтр("ru = 'Не задан ответственный представителя';
									|en = 'Не задан ответственный представителя'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "ОтветственныйПредставителя", "Объект", Отказ);
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаНачала)
		Или Не ЗначениеЗаполнено(ДатаОкончания)
		Или ДатаОкончания < ДатаНачала Тогда
		
		Если ВыводитьСообщения Тогда
			ТекстСообщения = НСтр("ru = 'Не корректно задан период действия доверенности';
									|en = 'Не корректно задан период действия доверенности'");
			Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
				Поле = "ДатаНачала";
			Иначе
				Поле = "ДатаОкончания";
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, Поле, "Объект", Отказ);
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
